In [1]:
import psycopg2
import psycopg2.extras
import pandas as pd

In [2]:
class PostgresConnection(object):
    def __init__(self):
        self.connection = psycopg2.connect(database = "ecomdb",
                                          user = "postgres",
                                          password = "Fahim1810",
                                          host = "127.0.0.1",
                                          port = "5432")
    def getConnection(self):
        print("Connection to DB established!")
        return self.connection
con = PostgresConnection().getConnection()

Connection to DB established!

In [3]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.division as "Division", SUM(fact_table.total_price) "Total Sale Price" 
FROM stars.fact_table 
JOIN stars.store_dim ON store_dim.store_key = fact_table.store_key 
GROUP BY store_dim.division 
ORDER BY store_dim.division"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_division = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

In [4]:
total_price_by_division

                                            Division  Total Sale Price
0  BARISAL                                       ...        7520343.75
1  CHITTAGONG                                    ...       19763595.00
2  DHAKA                                         ...       40764619.75
3  KHULNA                                        ...       11311610.50
4  RAJSHAHI                                      ...       12099196.00
5  RANGPUR                                       ...        8429836.50
6  SYLHET                                        ...        5512234.25

In [5]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.district as "District", SUM(fact_table.total_price) "Total Sale Price" 
FROM stars.fact_table 
JOIN stars.store_dim ON store_dim.store_key = fact_table.store_key 
GROUP BY store_dim.district 
ORDER BY store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_district = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

In [6]:
total_price_by_district

                                             District  Total Sale Price
0   BAGERHAT                                      ...        1307651.00
1   BANDARBAN                                     ...         995360.75
2   BARGUNA                                       ...         869041.00
3   BARISAL                                       ...        2897237.75
4   BHOLA                                         ...        1012205.75
..                                                ...               ...
59  SIRAJGANJ                                     ...        1295100.75
60  SUNAMGANJ                                     ...        1593774.00
61  SYLHET                                        ...        1727717.25
62  TANGAIL                                       ...        1774650.25
63  THAKURGAON                                    ...         729934.25

[64 rows x 2 columns]

In [11]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_dim.year as "Year", SUM(fact_table.total_price) "Total Sale Price"
FROM stars.fact_table
JOIN stars.time_dim ON time_dim.time_key = fact_table.time_key
GROUP BY time_dim.year
ORDER BY time_dim.year"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_year = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

In [12]:
total_price_by_year

     Year  Total Sale Price
0  2014.0       14334731.25
1  2015.0       15095720.25
2  2016.0       14976508.25
3  2017.0       15015806.00
4  2018.0       15108197.25
5  2019.0       14949510.25
6  2020.0       15037190.25
7  2021.0         883772.25

In [13]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_dim.month as "Month", SUM(fact_table.total_price) "Total Sale Price"
FROM stars.fact_table
JOIN stars.time_dim ON time_dim.time_key = fact_table.time_key
GROUP BY time_dim.month
ORDER BY time_dim.month"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_month = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

In [14]:
total_price_by_month

    Month  Total Sale Price
0     1.0        9042244.00
1     2.0        8073877.50
2     3.0        8939152.00
3     4.0        8504634.75
4     5.0        9078002.50
5     6.0        8556853.00
6     7.0        9046580.00
7     8.0        8929475.25
8     9.0        8724326.50
9    10.0        8902783.75
10   11.0        8680026.00
11   12.0        8923480.50